W8D1/app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "author_id", "post_id", "parent_comment_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "Second"], ["author_id", 2], ["post_id", 4], ["parent_comment_id", 1], ["created_at", "2021-03-09 01:01:43.384545"], ["updated_at", "2021-03-09 01:01:43.384545"]]
---
  def create
    @comment = Comment.new(comment_params)
    if @comment.save