W6D4/Artshare/app/controllers/comments_controller.rb

  def index
    if params[:user_id]
      comments = Comment.where("user_id = ?", params[:user_id])
    elsif params[:artwork_id]
      comments = Comment.where("artwork_id = ?", params[:artwork_id])
    else
      comments = Comment.all
---
SELECT "comments".* FROM "comments" WHERE (user_id = NULL)
SELECT "comments".* FROM "comments" WHERE (user_id = '4')

  def create
    comment = Comment.new(comment_params)
    if comment.save
---
INSERT INTO "comments" ("body", "user_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "hello world"], ["user_id", 6], ["artwork_id", 2], ["created_at", "2021-02-26 00:54:13.130859"], ["updated_at", "2021-02-26 00:54:13.130859"]]