W6D5/app/controllers/cats_controller.rb

  def update
    @cat = Cat.find_by(id: params[:id])

    if @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "cats" SET "sex" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["sex", "F"], ["updated_at", "2021-02-27 01:35:10.104400"], ["id", 3]]