W8D1/app/views/posts/show.html.erb

<ul>
  <% @post.comments.where(parent_comment_id: nil).each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 AND "comments"."parent_comment_id" IS NULL  [["post_id", 4]]