W7D2/app/controllers/albums_controller.rb

INSERT INTO "albums" ("title", "year", "live", "band_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Goodstuff"], ["year", 2021], ["live", true], ["band_id", 1], ["created_at", "2021-03-03 01:14:11.269263"], ["updated_at", "2021-03-03 01:14:11.269263"]]
---
  def create
    @album = Album.new(album_params)
    if @album.save

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "albums" SET "year" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["year", 2022], ["updated_at", "2021-03-03 01:17:33.654373"], ["id", 1]]
---
  def update
    @album = Album.find_by(id: params[:id])
    if @album.update(album_params)