W7D2/app/controllers/bands_controller.rb

INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Tiger"], ["created_at", "2021-03-02 22:45:43.835869"], ["updated_at", "2021-03-02 22:45:43.835869"]]
---
  def create
    @band = Band.new(bands_params)
    if @band.save

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "Tigers"], ["updated_at", "2021-03-02 22:45:56.960166"], ["id", 1]]
---
  def update
    @band = Band.find_by(id: params[:id])
    if @band.update(bands_params)